mysql.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-09 Tue 11:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Book of Web</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matthew Thompson" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">The Book of Web</h1>
<br>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-center" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./#">◀ JQuery</a></td>
<td class="org-center"><a href="./index.html">Table of contents</a></td>
<td class="org-right"><a href="./php.html">PHP ▶</a></td>
</tr>
</tbody>
</table>

<div id="outline-container-org45100ec" class="outline-2">
<h2 id="org45100ec"><span class="section-number-2">1</span> MySQL</h2>
<div class="outline-text-2" id="text-1">
</div>

<div id="outline-container-orge262efb" class="outline-3">
<h3 id="orge262efb"><span class="section-number-3">1.1</span> Create your tables</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Because we are creating a database for <b>films</b>, it makes sense to have a film table. For now, our film table will have attributes for:
</p>

<ul class="org-ul">
<li><b>title</b>: the title of the film</li>
<li><b>genre</b>: the film's genre (action, suspense, documentary, etc)</li>
<li><b>running length</b>: the film's run time in minutes</li>
</ul>

<p>
Also, every table will have an <b>ID</b> column. This is very important, is it will be used as a <b>primary key</b> for each piece of data that's put into the database. A primary key is a piece of data that uniquely identifies each row (piece of data) in a database table.
</p>

<p>
When creating a database table, we have to think carefully about the datatypes for each database column. The ID column must always be an <b>integer</b> (<code>INT</code> in MySQL), and it needs to be unique for each row. To ensure this, we can add some constraints
</p>

<ul class="org-ul">
<li><code>AUTO_INCREMENT</code>: This will automatically add 1 to every new row in the table</li>
<li><code>NOT NULL</code>: This makes sure that the data has some value, which is important for the ID column as every row <span class="underline">must</span> have a unique ID as its primary key!</li>
</ul>

<p>
The other columns in our film table are more open to interpretation. We use <code>VARCHAR(255)</code> as the datatypes for both the film's title and genre. This is the equivalent of a <i>string</i> type in other languages, meaning that it is just a piece of text. The 255 in <code>VARCHAR(255)</code> is the maximum size of the string in bytes. Don't worry about this too much, just remember that 255 is the usual number to use for this. The <code>VAR</code> in <code>VARCHAR</code> means that the text's length is variable (i.e. it doesn't always have to be 255 bytes in size). Again, don't worry about this too much - we'll cover standard <code>VAR</code> types (and why you would use them) later.
</p>

<p>
The final column in our table is <code>running_length</code>, which will be the length of a movie in minutes and can just be an integer (<code>INT</code> in MySQL).
</p>

<p>
Here's how to create a table with the above constraints in MySQL:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">film</span> <span style="color: #8c8c8c;">(</span>
  id <span style="color: #9370db;">INT</span> AUTO_INCREMENT <span style="color: #20b2aa; font-weight: bold;">NOT</span> <span style="color: #20b2aa; font-weight: bold;">NULL</span>,
  title <span style="color: #9370db;">VARCHAR</span><span style="color: #93a8c6;">(</span><span style="color: #1e90ff;">255</span><span style="color: #93a8c6;">)</span>,
  genre <span style="color: #9370db;">VARCHAR</span><span style="color: #93a8c6;">(</span><span style="color: #1e90ff;">255</span><span style="color: #93a8c6;">)</span>,
  running_length <span style="color: #9370db;">int</span>,
  <span style="color: #20b2aa; font-weight: bold;">PRIMARY</span> <span style="color: #20b2aa; font-weight: bold;">KEY</span> <span style="color: #93a8c6;">(</span>id<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
The final line that says <code>PRIMARY KEY (id)</code> states that the ID column is the primary key - the column that will uniquely identify each row of the database. Be careful to put the name of the column (id) inside parentheses! The parentheses are there in case you want to put multiple column names to form a compound primary key.
</p>

<p>
OK, so now we've created our film table. What next? How about adding some directors?
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">director</span> <span style="color: #8c8c8c;">(</span>
  id <span style="color: #9370db;">INT</span> AUTO_INCREMENT <span style="color: #20b2aa; font-weight: bold;">NOT</span> <span style="color: #20b2aa; font-weight: bold;">NULL</span>,
  surname <span style="color: #9370db;">VARCHAR</span><span style="color: #93a8c6;">(</span><span style="color: #1e90ff;">255</span><span style="color: #93a8c6;">)</span>,
  firstname <span style="color: #9370db;">VARCHAR</span><span style="color: #93a8c6;">(</span><span style="color: #1e90ff;">255</span><span style="color: #93a8c6;">)</span>,
  date_of_birth <span style="color: #9370db;">DATE</span>
  <span style="color: #20b2aa; font-weight: bold;">PRIMARY</span> <span style="color: #20b2aa; font-weight: bold;">KEY</span> <span style="color: #93a8c6;">(</span>id<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
The structure of this director table is much the same as for the film table above, but with one difference: we've added a <code>date_of_birth</code> column for the director's birthday. This is a datatype that expects a date of the format YYYY-MM-DD (year, month, day), such as "1985-12-31". We'll explain this further when we start <a href="#insert-data">inserting rows into the database</a>.
</p>

<p>
Time to add one more table, this time for actors. For this one, we'll keep the same columns we used for the director table, but add some <code>INT</code> columns for height and weight, and an <code>ENUM</code> for the director's sex. In this case, we want to represent their sex as "m" for male and "f" for female, and accept no other inputs. This is what we use <code>ENUM</code> types for. By putting the type as <code>ENUM('m', 'f')</code>, we are stating that we will only accept "m" or "f" as the input here.
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">actor</span> <span style="color: #8c8c8c;">(</span>
  id <span style="color: #9370db;">INT</span> AUTO_INCREMENT <span style="color: #20b2aa; font-weight: bold;">NOT</span> <span style="color: #20b2aa; font-weight: bold;">NULL</span>,
  surname <span style="color: #9370db;">VARCHAR</span><span style="color: #93a8c6;">(</span><span style="color: #1e90ff;">255</span><span style="color: #93a8c6;">)</span>,
  firstname <span style="color: #9370db;">VARCHAR</span><span style="color: #93a8c6;">(</span><span style="color: #1e90ff;">255</span><span style="color: #93a8c6;">)</span>,
  sex ENUM<span style="color: #93a8c6;">(</span><span style="color: #ffa07a;">'m'</span>, <span style="color: #ffa07a;">'f'</span><span style="color: #93a8c6;">)</span>,
  height_cm <span style="color: #9370db;">INT</span>,
  weight_kg <span style="color: #9370db;">INT</span>,
  date_of_birth <span style="color: #9370db;">DATE</span>
  <span style="color: #20b2aa; font-weight: bold;">PRIMARY</span> <span style="color: #20b2aa; font-weight: bold;">KEY</span> <span style="color: #93a8c6;">(</span>id<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
OK, so we've created our tables! Nice work. Time to start linking them together. For that, we need to use <i>foreign keys</i>.
</p>
</div>
</div>

<div id="outline-container-orgce7353b" class="outline-3">
<h3 id="orgce7353b"><span class="section-number-3">1.2</span> Foreign keys</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">DROP</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">film</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">film</span> <span style="color: #8c8c8c;">(</span>
  id <span style="color: #9370db;">INT</span> AUTO_INCREMENT <span style="color: #20b2aa; font-weight: bold;">NOT</span> <span style="color: #20b2aa; font-weight: bold;">NULL</span>,
  title <span style="color: #9370db;">VARCHAR</span><span style="color: #93a8c6;">(</span><span style="color: #1e90ff;">255</span><span style="color: #93a8c6;">)</span>,
  genre <span style="color: #9370db;">VARCHAR</span><span style="color: #93a8c6;">(</span><span style="color: #1e90ff;">255</span><span style="color: #93a8c6;">)</span>,
  director_id <span style="color: #9370db;">INT</span>,

<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org173e4bf" class="outline-3">
<h3 id="insert-data"><a id="org173e4bf"></a><span class="section-number-3">1.3</span> Insert data into your tables</h3>
<div class="outline-text-3" id="text-insert-data">
</div>
</div>
</div>
</div>
</body>
</html>
